DELETE
FROM user_roles;
DELETE
FROM users;
DELETE
FROM meals;
ALTER SEQUENCE global_seq RESTART WITH 100000;

INSERT INTO users (name, email, password)
VALUES ('User', 'user@yandex.ru', 'password'),
       ('Admin', 'admin@gmail.com', 'admin');

INSERT INTO user_roles (role, user_id)
VALUES ('USER', 100000),
       ('ADMIN', 100001);

INSERT INTO meals (user_id, date_time, description, calories)
VALUES (100000, '15-10-2020 10:00', 'Завтрак', 500),
       (100000, '15-10-2020 14:00', 'Обед', 1000),
       (100000, '15-10-2020 18:00', 'Ужин', 500),
       (100000, '16-10-2020 10:00', 'Завтрак', 500),
       (100000, '16-10-2020 15:00', 'Обед', 1000),
       (100000, '16-10-2020 00:00', 'Еда на граничное значение', 120),
       (100000, '16-10-2020 22:00', 'Ужин', 500),
       (100001, '15-10-2020 10:00', 'Завтрак Админа', 400),
       (100001, '15-10-2020 14:00', 'Обед Админа', 1200),
       (100001, '15-10-2020 18:00', 'Ужин Админа', 300),
       (100001, '16-10-2020 10:00', 'Завтрак Админа', 300),
       (100001, '16-10-2020 15:00', 'Обед Админа', 900),
       (100001, '16-10-2020 16:00', 'Перекус Админа', 200),
       (100001, '16-10-2020 22:00', 'Ужин Админа', 1000);